[
  {
    "content" : "**Arranging your own travel**\nIf you have chosen the adventurous path to not get our Hassle-free™️ ticket, here's the way plan your trip to the venue.\n\nFrom Amsterdam or Schiphol you can take a train to Den Helder, where you can take a bus to the harbour where the boat to Texel departs. On Texel you can use a minivan service to get to our venue, Prins Hendrik.\n\nThe adres of the conference venue is:\n\nPrins Hendrik Texel\nStuifweg 13\n1794 HA Oosterend\n\nYou can plan most of the trip (train, bus and boat) using the links below.\n\n**Amsterdam Central Station → Texel** First train with matching connections leaves at 5:29  Last train with matching connections leaves at 19.39  Travel time: ~ 2 hours and 30 minutes (depending on connections)  [Route planner](https:\/\/9292.nl\/en\/planner\/...).\n\n**Schiphol → Texel**. First train with matching connections leaves at 5:02  Last train with matching connections leaves at 19.18  Travel time: ~ 2 hours and 30 minutes (depending on connections)  [Route planner](https:\/\/9292.nl\/en\/planner\/...).\n **Trains (part 1)**\n There's a trainstation right underneath Schiphol airport, so if you follow the signage after you go through the baggage hall you should be able to find it easily.\n The first train you need to take goes in the direction of Amsterdam and usually departs from tracks 1 or 2. Which one is only announced a short time before, but those are on opposite sides of the platform. It's only a 10 minute trip to Amsterdam Sloterdijk where you have to change to the train to Den Helder. Usually you will arrive at platform 11 on the 2nd floor, and have to go down two flights of stairs to depart at platform 4. Follow the signage.\n When you are in the train to Den Helder, it is a great time to start arranging your [Texelhopper trip](https:\/\/boeking.texelhopper.nl\/booking) from 'Pontweg Veerhaven, 't Horntje (1-1)' to 'Prins Hendrik, Oost (200-6)', which you will have to book one hour in advance.\n\n**Bus (part 2)**\n Once you get to Den Helder train station, you can find the bus platforms on the right hand side of the station. The bus to the harbour is line 33, which departs from platform E and will be marked on the sign at the bus stop and on the front of the bus itself. This bus costs €1,50 and tickets can only be bought at Den Helder Station. See below how to get them.\n **Directions to bus line 33 at Den Helder station.**\n If the weather is nice, you can also [walk to the ferry](https:\/\/www.google.com\/maps\/dir\/...), this takes around 30 minutes.\n\n**Ferry (part 3)**\nFrom the bus stop at the harbour it's only a short walk to the Ferry towards Texel. **There is a buffet-restaurant on the boat**, if you plan to get some food there, be sure to head there right after your get on the boat, because the boattrip only lasts about 20 minutes.\n\n**Texelhopper minivan (part 4)**\nOn the island you can use the [Texelhopper minibus service](https:\/\/boeking.texelhopper.nl\/booking) to get to the venue. **You have to order a Texelhopper at least one hour in advance**, so be sure to read the information on their website. Plan your trip from trip from 'Pontweg Veerhaven, 't Horntje (1-1)', which is where the ferry arrives to 'Prins Hendrik, Oost (200-6)', which is our conference venue.\n\n**Getting tickets**\nWhen travelling in the Netherlands you can always get a ticket at any station at a ticket machine. These machines either take cash in euro or debit cards with the maestro logo (without extra cost). Paying with credit cards is possible (just not everywhere) but please note that the transaction costs can be high.\n\n**Cash money**\nWhen traveling in the Netherlands we advise to have some cash in you wallet because not every shop accepts debit\/credit cards.\n\n**Train from Amsterdam \/ Schiphol**\nTrains are operated by NS (Nederlandse Spoorwegen). You can get you train ticket [the NS website](https:\/\/www.ns.nl\/producten\/en\/losse-kaartjes-toeslagen), or at the ticket vending machines at the station. Your desitination station needs to be Den Helder.\n\n**Bus & Texelhopper**\nFrom Den Helder train station to the harbour it's a [short bus ride with Connexxion line 33](https:\/\/www.texelhopper.nl\/en\/shop\/tickets\/one-way-ticket-line-33-den-helder). This bus ride costs €1,50 and cannot be bought online. If you need to pay cash, you have to buy it at the ticket booth at Den Helder station. On board the bus you can only pay with PIN, credit card or Dutch public transport card (OV-Chipkaart). The return travel from the boat to the station is free.\n\nOn the island you can use the [Texelhopper minibus](https:\/\/boeking.texelhopper.nl\/booking) to get to the venue. A ticket for Texelhopper can be bought online, at the ticket booth in Den Helder train station, or for your return trip at the reception of Prins Hendrik. You have to order a Texelhopper at least one hour in advance, so be sure to read the information on their website.\n\n**Ferry Tickets**\nYou can get your ferry ticket from the [TESO website](https:\/\/www.teso.nl\/en\/tickets\/). All tickets are return tickets and can be used at any date.",
    "createdAt" : "2025-08-20T08:13:00.000Z",
    "id" : "255f454e-b360-8103-842c-cde720b1be5e",
    "imageName" : "",
    "lastModified" : "2025-08-20T08:13:00.000Z",
    "name" : "travel",
    "title" : "Travel to the island"
  },
  {
    "content" : "If you bought a [Hassle Free travel ticket](https:\/\/ti.to\/swiftisland\/2025\/with\/hassle-free-travel), a tourbus will pick you up from Schiphol Airport and drop you off on Texel, right in front of our conference venue.\n\n**Bus schedule**\n 1 September Schiphol 14:30 → Texel 17:30\n 5 September Texel 8:30 → Schiphol 11.30\n 7 September Texel 13:30 → Schiphol 16:30\n\n Because we are dependent on the ferryboat schedule, the bus will leave at the specified times, even if you're not there. All arrival times are estimates, because there can be some unexpected delays due to traffic.\n\n**Please allow some room for delays in your travel schedule, so you won't miss the bus *or* your flight home.**\n\nDid you not buy a hassle free travel ticket yet? [You can get one here](https:\/\/ti.to\/swiftisland\/2025\/with\/hassle-free-travel)",
    "createdAt" : "2025-08-20T08:13:00.000Z",
    "id" : "255f454e-b360-81a2-befe-c7a28b228a31",
    "imageName" : "",
    "lastModified" : "2025-08-20T08:13:00.000Z",
    "name" : "hassleFree",
    "title" : "Hassle Free Travel"
  },
  {
    "content" : "All attendees, mentors, sponsors and volunteers at our conference are required to agree with the following code of conduct. Organisers will enforce this code throughout the event. We expect cooperation from all participants to help ensure a safe environment for everybody.\n\n**Need Help? Contact Us!**\n\nNiels van Hoorn\nTwitter: [@nvh](https:\/\/twitter.com\/nvh)\nEmail: [niels@swiftisland.nl](niels@swiftisland.nl)\n\nSidney de Koning\nTwitter: [@sidneydekoning](https:\/\/twitter.com\/sidneydekoning)\nEmail: [sidney@swiftisland.nl](sidney@swiftisland.nl)\n\n**The Quick Version**\nAll attendees, speakers, sponsors and volunteers at our conference are required to agree with the following code of conduct. Organisers will enforce this code throughout the event. We expect cooperation from all participants to help ensure a safe environment for everybody.\n\nOur conference is dedicated to providing a harassment-free conference experience for everyone, regardless of gender, gender identity and expression, age, sexual orientation, disability, physical appearance, body size, race, ethnicity, religion (or lack thereof), or technology choices. We do not tolerate harassment of conference participants in any form. Sexual language and imagery is not appropriate for any conference venue, including talks, workshops, parties, Twitter and other online media. Conference participants violating these rules may be sanctioned or expelled from the conference without a refund at the discretion of the conference organisers.\n\n**The Less Quick Version**\nHarassment includes offensive verbal comments related to gender, gender identity and expression, age, sexual orientation, disability, physical appearance, body size, race, ethnicity, religion, technology choices, sexual images in public spaces, deliberate intimidation, stalking, following, harassing photography or recording, sustained disruption of talks or other events, inappropriate physical contact, and unwelcome sexual attention.\n\nParticipants asked to stop any harassing behavior are expected to comply immediately.\n\nSponsors are also subject to the anti-harassment policy. In particular, sponsors should not use sexualised images, activities, or other material. Booth staff (including volunteers) should not use sexualised clothing\/uniforms\/costumes, or otherwise create a sexualised environment.\n\nIf a participant engages in harassing behavior, the conference organisers may take any action they deem appropriate, including warning the offender or expulsion from the conference with no refund.\n\nIf you are being harassed, notice that someone else is being harassed, or have any other concerns, please contact a member of conference staff immediately. Conference staff can be identified as they'll be wearing branded clothing and\/or badges.\n\nConference staff will be happy to help participants contact hotel\/venue security or local law enforcement, provide escorts, or otherwise assist those experiencing harassment to feel safe for the duration of the conference. We value your attendance.\n\nWe expect participants to follow these rules at conference and workshop venues and conference-related social events.",
    "createdAt" : "2025-08-20T08:13:00.000Z",
    "id" : "255f454e-b360-8151-a8e6-dd66e2379d2b",
    "imageName" : "",
    "lastModified" : "2025-08-20T08:13:00.000Z",
    "name" : "codeOfConduct",
    "title" : "Code of Conduct"
  },
  {
    "content" : "https:\/\/join.slack.com\/t\/swiftisland\/shared_invite\/zt-8b89q4z9-URegs7vorV8dU3dBpJ6w0g",
    "createdAt" : "2025-08-20T08:13:00.000Z",
    "id" : "255f454e-b360-8142-a43b-c745d3a8b282",
    "imageName" : "",
    "lastModified" : "2025-08-20T08:13:00.000Z",
    "name" : "joinSlack",
    "title" : ""
  },
  {
    "content" : "For those that have a [Hassle Free travel ticket](https:\/\/ti.to\/swiftisland\/2025\/with\/hassle-free-travel), we have an arrangement with the Sheraton at Schiphol, right next to Schiphol Airport, where you can wait for the bus and relax in their lounge bar.\n\nThere is wifi, power outlets, and your first drink is on us.\n\nTo get to the Sheraton from Schiphol Plaza, follow signs to Sheraton. You will enter a covered walkway via an escalator.",
    "createdAt" : "2025-08-20T08:13:00.000Z",
    "id" : "255f454e-b360-81e0-aa3d-ddccb688a789",
    "imageName" : "schiphol",
    "lastModified" : "2025-08-20T08:13:00.000Z",
    "name" : "schiphol",
    "title" : "Schiphol"
  }
]